app/controllers/movies_controller.rb

  def index

	sort_by = params[:sort_by] || session[:sort_by]
	case sort_by
		when "title"
			ordered = {:order => :title}
			#@movies = Movie.where(rating: [session[:mine]]).order(:title)
			@tit_class = 'hilite'
		when "release_date"
			ordered = {:order => :release_date}
			#@movies = Movie.where(rating: [session[:mine]]).order(:release_date)
			@rel_class = 'hilite'
	end

	@all_ratings = Movie.all_ratings
	@checked = params[:ratings] || session[:ratings] || {}
	if @checked == {}
		@checked = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess