app/controllers/movies_controller.rb

  def index
	  if params[:sort_by] == "title"
	  	@movies = Movie.find(:all, :order => "title")
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]